Core/src/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШтрихкодыНоменклатуры</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </resources>
  <attributes>
    <name>AzRyНоменклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyСтрана</name>
    <type>
      <types>CatalogRef.AzRyШтрихкодСтрана</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyЗарезервировано</name>
    <type>
      <types>CatalogRef.AzRyШтрихкодЗарезервировано</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyМодель</name>
    <type>
      <types>CatalogRef.AzRyШтрихкодМодель</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyКатегория</name>
    <type>
      <types>CatalogRef.AzRyШтрихкодКатегория</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyБренд</name>
    <type>
      <types>CatalogRef.AzRyШтрихкодБренд</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyПродукт</name>
    <type>
      <types>CatalogRef.AzRyШтрихкодПродукт</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyКонтрольноеЧисло</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/src/InformationRegisters/ШтрихкодыНоменклатуры/Forms/ФормаЗаписи/Module.bsl
#Область СлужебныеПроцедурыИФункции

// Формирует штрихкод EAN13.
//
&НаСервереБезКонтекста
Функция СформироватьШтрихкодEAN13()
	
	Возврат РегистрыСведений.ШтрихкодыНоменклатуры.СформироватьШтрихкодEAN13();
	
КонецФункции // СформироватьШтрихкодEAN13()

&НаСервереБезКонтекста
Функция СформироватьШтрихкодEAN13ВесовогоТовара(ПрефиксВесовогоТовара = "1")
	
	Возврат РегистрыСведений.ШтрихкодыНоменклатуры.СформироватьШтрихкодВесовогоТовараEAN13(ПрефиксВесовогоТовара);
	
КонецФункции

// ПодключаемоеОборудование
&НаКлиенте
Функция ПолученыШтрихкоды(ДанныеШтрикодов)
	
	Модифицированность = Истина;
	
	Если ДанныеШтрикодов.Количество() > 0 Тогда
		Запись.Штрихкод = ДанныеШтрикодов[ДанныеШтрикодов.Количество() - 1].Штрихкод;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции // ПолученыШтрихкоды()
// Конец ПодключаемоеОборудование

// Процедура обработчик команды НовыйШтрихкод.
//
&НаКлиенте
Процедура НовыйШтрихкод(Команда)
	
	Если ИспользоватьОбменСПодключаемымОборудованиемOffline Тогда
		ПрефиксВесовогоТовара = 1;
		ПоказатьВводЧисла(Новый ОписаниеОповещения("НовыйШтрихкодЗавершение", ЭтотОбъект, Новый Структура("ПрефиксВесовогоТовара", ПрефиксВесовогоТовара)), ПрефиксВесовогоТовара, НСтр("ka='თუ საქონელი არის წონითი, მაშინ შეიყვანეთ წონითი საქონლის პრეფიქსი ან დააჭირეთ ღილაკ გაუქმება-ს.';ru='Если товар весовой, то введите префикс весового товара или нажмите кнопку Отмена';en='If the goods weight, enter your weight goods prefix or click Cancel'"), 1, 0);
	Иначе
		Запись.Штрихкод = СформироватьШтрихкодEAN13();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НовыйШтрихкодЗавершение(Результат1, ДополнительныеПараметры) Экспорт
    
    ПрефиксВесовогоТовара = ?(Результат1 = Неопределено, ДополнительныеПараметры.ПрефиксВесовогоТовара, Результат1);
    
    
    Результат = (Результат1 <> Неопределено);
    Если Результат Тогда
        Запись.Штрихкод = СформироватьШтрихкодEAN13ВесовогоТовара(ПрефиксВесовогоТовара);
    Иначе
        Запись.Штрихкод = СформироватьШтрихкодEAN13();
    КонецЕсли;

КонецПроцедуры // НовыйШтрихкод()

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ПодключаемоеОборудование
	ИспользоватьПодключаемоеОборудование = УправлениеНебольшойФирмойПовтИсп.ИспользоватьПодключаемоеОборудование();
	ИспользоватьОбменСПодключаемымОборудованиемOffline = ПолучитьФункциональнуюОпцию("ИспользоватьОбменСПодключаемымОборудованиемOffline");
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры // ПриСозданииНаСервере()

// Процедура - обработчик события ПриОткрытии.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект, "СканерШтрихкода");
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры // ПриОткрытии()

// Процедура - обработчик события ПриЗакрытии.
//
&НаКлиенте
Процедура ПриЗакрытии()
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры // ПриЗакрытии()

// Процедура - обработчик события ОбработкаОповещения.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование"
	   И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			//Преобразуем предварительно к ожидаемому формату
			Данные = Новый Массив();
			Если Параметр[1] = Неопределено Тогда
				Данные.Добавить(Новый Структура("Штрихкод, Количество", Параметр[0], 1)); // Достаем штрихкод из основных данных
			Иначе
				Данные.Добавить(Новый Структура("Штрихкод, Количество", Параметр[1][1], 1)); // Достаем штрихкод из дополнительных данных
			КонецЕсли;

			ПолученыШтрихкоды(Данные);
		ИначеЕсли ИмяСобытия = "DataCollectionTerminal" Тогда
			ПолученыШтрихкоды(Параметр);
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры // ОбработкаОповещения()

// Процедура - обработчик события ОбработкаПроверкиЗаполненияНаСервере.
//
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ШтрихкодыНоменклатуры.Штрихкод,
	|	ШтрихкодыНоменклатуры.Номенклатура,
	|	ШтрихкодыНоменклатуры.Характеристика,
	|	ШтрихкодыНоменклатуры.Партия,
	|	ПРЕДСТАВЛЕНИЕ(ШтрихкодыНоменклатуры.Номенклатура) КАК НоменклатураПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ШтрихкодыНоменклатуры.Характеристика) КАК ХарактеристикаПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ШтрихкодыНоменклатуры.Партия) КАК ПартияПредставление
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";
	
	Запрос.УстановитьПараметр("Штрихкод", Запись.Штрихкод);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() // Штрихкод уже записан в БД
	   И Запись.ИсходныйКлючЗаписи.Штрихкод <> Запись.Штрихкод Тогда
		
		ОписаниеОшибки = НСтр("ka='ასეთი შტრიხკოდი უკვე დანიშნულია ნომენკლატურისთვის  %Номенклатура%';ru='Такой штрихкод уже назначен для номенклатуры %Номенклатура%';en='This barcode has already been assigned to the range of% Range%'");
		ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%Номенклатура%", """" + Выборка.НоменклатураПредставление + """"
		                + ?(ЗначениеЗаполнено(Выборка.Характеристика), " " + НСтр("ka='მახასიათებლით';ru='с характеристикой';en='with characteristic'") + " """ + Выборка.ХарактеристикаПредставление + """", "")
		                + ?(ЗначениеЗаполнено(Выборка.Партия), " """ + НСтр("ka='პარტიასთან';ru='с партией';en='with the party'") + " " + Выборка.ПартияПредставление + """", ""));
		
		УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(ЭтаФорма, ОписаниеОшибки, , , "Запись.Штрихкод", Отказ);
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполненияНаСервере()

#КонецОбласти
